const handler = async (m, {conn, isPrems}) => {
  const hasil = Math.floor(Math.random() * 5000);
  const time = global.db.data.users[m.sender].lastwork + 600000;
  if (new Date - global.db.data.users[m.sender].lastwork < 600000) 
    return conn.reply(m.chat, `*أنت لسه متعب، لازم تستريح على الأقل ${msToTime(time - new Date())} عشان تقدر تشتغل تاني!*`, m, {contextInfo: {externalAdReply :{ mediaUrl: null, mediaType: 1, description: null, title: wm, body: '', previewType: 0, thumbnail: img.getRandom(), sourceUrl: redes.getRandom()}}})
  
  m.reply(`🛠 *${pickRandom(global.work)} ${hasil} XP*`) 
  global.db.data.users[m.sender].exp += hasil;
  global.db.data.users[m.sender].lastwork = new Date() * 1;
};
handler.help = ['عمل']
handler.tags = ['econ']
handler.command = /^(عمل)$/i
handler.register = true
export default handler

function msToTime(duration) {
  const milliseconds = parseInt((duration % 1000) / 100);
  let seconds = Math.floor((duration / 1000) % 60);
  let minutes = Math.floor((duration / (1000 * 60)) % 60);
  let hours = Math.floor((duration / (1000 * 60 * 60)) % 24);
  hours = (hours < 10) ? '0' + hours : hours;
  minutes = (minutes < 10) ? '0' + minutes : minutes;
  seconds = (seconds < 10) ? '0' + seconds : seconds;
  return minutes + ' دقيقة و ' + seconds + ' ثانية ';
}

function pickRandom(list) {
  return list[Math.floor(list.length * Math.random())];
}

global.work = [
  'أنت أستاذ كيمياء، بتصنع جرع غامضة في محاولة لاكتشاف أسرار ضايعة. تحصل على: ', 
  'تواجه الشخص اللي قال إن الروبوتات بتتعمل بـ Termux وبتحصل على:', 
  'تصبح صياد كنوز جريء، تستكشف أماكن نسيها الزمن بحثًا عن ثروات مخفية. تحصل على:', 
  'تعتني بمجموعات بوت سفروت وتربح', 
  'تساعد في إدارة مجموعة بوت سفروت وتكسب', 
  'تساعد في إدارة مجموعة بوت سفروت وتربح', 
  'تساعد في إدارة مجموعة The-Shadow-Brokers-Bot وتكسب', 
  'تعمل لصالح شركة عسكرية خاصة، وتحصل على', 
  'تنظم حدث لتذوق النبيذ وتربح', 
  'تدير عملًا لتحويل المعادن، وتحول الشائع إلى كنوز ثمينة. تحصل على:', 
  'تستكشف أطلال قديمة وتجد قطعة أثرية قيمة تمنحك معرفة أسلافك. تحصل على:', 
  'تعمل كمحارب مرتزق في حرب ملحمية، وتواجه التحديات بمهارتك وشجاعتك. تحصل على:', 
  'تعمل كـ باحث في الظواهر الخارقة، وتكتشف أسرار العالم الروحي. تحصل على:', 
  'تدرب التنانين للسباقات، وتبني علاقات مع هذه المخلوقات الرائعة. تحصل على:', 
  'تصبح أفضل حداد في المدينة، وتقوم بصناعة أسلحة أسطورية وقطع أثرية قوية. تحصل على:', 
  'تكتشف غابة ساحرة مليئة بالكائنات السحرية، وتخلق اتصالًا فريدًا مع الطبيعة. تحصل على:', 
  'تكون مدربًا للوحوش المفترسة، وتتحكم في أكثر الكائنات وحشية بمهارتك في التحكم بالحيوانات. تحصل على:', 
  'تسافر عبر الزمن وتحل المشكلات التاريخية، وتؤثر على مصير الحضارات الماضية. تحصل على:', 
  'تكون مستشارًا ملكيًا، وتقدم الحكمة والنصائح للحكام والقادة. تحصل على:', 
  'تطور تكنولوجيا مستقبلية، وتدفع الابتكار وتغير مسار العالم. تحصل على:', 
  'تكون خبيرًا في فن الإقناع، وتقنع الآخرين ببلاغتك ودهائك.', 
  'تقود آلة حربية عملاقة في معارك ملحمية، وتدافع عن الأرض بمهارتك في الآلة الحربية. تحصل على:', 
  'تدير مزرعة تنانين، وتعتني بهذه المخلوقات الرائعة وتربي تنانين فريدة. تحصل على:', 
  'تكون جاسوسًا دوليًا، وتخترق المنظمات السرية وتكشف المؤامرات المظلمة. تحصل على:', 
  'تستكشف الفضاء وتكتشف اكتشافات مذهلة تمنحك رؤية فريدة للكون. تحصل على:', 
  'تكون ساحرًا مشهورًا، وتؤدي عروضًا مذهلة وتقوم بأداء تعاويذ سحرية. تحصل على:', 
  'تكون عالمًا مجنونًا، وتخلق اختراعات غريبة وتجارب غير عادية. تحصل على:', 
  'تدافع عن المملكة ضد جيش غازٍ، وتقود الجيوش وتظهر شجاعتك في المعركة. تحصل على:', 
  'تكون ملاحًا جريئًا، وتستكشف بحار غير مكتشفة وتكتشف جزر مليئة بالكنوز. تحصل على:', 
  'تكون خبيرًا في فن التخفي، وتتحرك في الظلال وتؤدي مهامًا سرية. تحصل على:', 
  'تكون طاهٍ مشهورًا، وتعد أطباقًا لذيذة تسعد أذواق الناس في كل مكان. تحصل على:', 
  'تحقق في الجرائم المعقدة كـ محقق بارع، وتحل الألغاز المثيرة. تحصل على:', 
  'تكون دبلوماسيًا بارعًا، وتفاوض على المعاهدات والتحالفات للحفاظ على السلام بين الدول. تحصل على:', 
  'تكون شامانًا قويًا، وتستخدم القوى الروحية للشفاء والحماية. تحصل على:', 
  'تطور تطبيقات سحرية للأجهزة المسحورة، وتحسن حياة الناس باختراعاتك. تحصل على:', 
  'تكون بطلًا في البطولات القتالية، وتظهر براعتك في القتال اليدوي. تحصل على:', 
  'تكون مهندسًا معماريًا ذو رؤية، وتصمم مدنًا مستقبلية وهياكل مدهشة. تحصل على:', 
  'تكون نفسيًا بقدرات خارقة، وتستكشف العقول وتنبئ بالمستقبل. تحصل على:', 
  'تكون مخرجًا مشهورًا، وتبدع قصصًا ملحمية تأسر الجماهير. تحصل على:', 
  'تكون عالم فلك وتكتشف كوكبًا جديدًا، وتوسع معرفتنا بالكون. تحصل على:', 
  'تكون خبيرًا في البقاء، وتواجه أخطار العالم بذكاء وشجاعة. تحصل على:', 
  'تكون موسيقيًا موهوبًا تعزف في حفلات ضخمة، وتملأ الجو بألحان ساحرة.',
  'تكون مستكشفًا أعماق البحر، وتغوص في أعماق المحيط لاكتشاف الكنوز المفقودة. تحصل على:', 
  'تكون مصمم أزياء مشهور، وتخلق صيحات جديدة وتلبس الناس بأسلوبك الفريد.',
  'تكون قائدًا ثوريًا، وتقاتل من أجل عالم أفضل وتقود الجماهير نحو الحرية. تحصل على:', 
  'تكون طبيبًا يكتشف علاجًا لمرض قاتل، وتنقذ العديد من الأرواح. تحصل على:', 
  'تكون هاكرًا إلكترونيًا، وتبحر في الفضاء السيبراني وتكشف الأسرار الرقمية. تحصل على:', 
  'تكون بستانيًا متخصصًا، وتكتشف نباتًا نادرًا وتكشف خصائصه الفريدة. تحصل على:', 
  'تكون صيادًا للأساطير، وتستكشف الأساطير وتكشف الحقيقة وراء القصص. تحصل على:', 
  'تكون عالم آثار وتكتشف مدينة قديمة، وتكشف أسرار الحضارات الماضية. تحصل على:', 
  'تكون قائدًا روحيًا محترمًا، وتوجه الآخرين نحو الاستنارة والسلام الداخلي. تحصل على:', 
  'تكون لاعبًا محترفًا، وتتنافس في البطولات النخبوية وتظهر مهارتك في الألعاب. تحصل على:',
];
